## Plan Result (annotations-api-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/197071)



<pre><code>Plan: 0 to add, 54 to change, 0 to destroy.</code></pre>

* Update
  * aws_acm_certificate.application_alb_certificate_93966247
  * aws_alb.application_application_load_balancer_alb_05EA9801
  * aws_alb_listener.application_listener_http_D74EC0ED
  * aws_alb_listener.application_listener_https_D31CB055
  * aws_alb_listener_rule.application_ecs_service_listener_rule_903F815F
  * aws_alb_target_group.application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B
  * aws_alb_target_group.application_ecs_service_green_target_group_ecs_target_group_4E06DCA6
  * aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99
  * aws_cloudwatch_log_group.app-log-group
  * aws_cloudwatch_log_group.aws-otel-collector-log-group
  * aws_cloudwatch_log_group.sqs-event-consumer_lambda_log-group_A465ADCF
  * aws_cloudwatch_metric_alarm.application_alarm-httptarget5xxerrorrate_F94D87C0
  * aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1
  * aws_cloudwatch_metric_alarm.application_autoscaling_scale_out_alarm_E40FCBA0
  * aws_cloudwatch_metric_alarm.synthetics_synthetics_synthetic_check_alarm_query_0_52F9FF21
  * aws_cloudwatch_metric_alarm.synthetics_synthetics_synthetic_check_alarm_uptime_0_3A56DFC7
  * aws_codedeploy_app.application_ecs_service_ecs_codedeploy_ecs_code_deploy_C2F7CBCF
  * aws_codedeploy_app.sqs-event-consumer_lambda-code-deploy_code-deploy-app_71E01125
  * aws_codedeploy_deployment_group.application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_48384247
  * aws_codedeploy_deployment_group.sqs-event-consumer_lambda-code-deploy_code-deployment-group_35D3D807
  * aws_codestarnotifications_notification_rule.application_ecs_service_ecs_codedeploy_ecs_codedeploy_notifications_CB44EADE
  * aws_dynamodb_table.dynamodb_highlight-notes_dynamodb_table_8BD520BF
  * aws_ecr_repository.application_ecs_service_ecr-app_ecr-repo_ABFE17F0
  * aws_ecs_cluster.application_ecs_cluster_4DC6EFB3
  * aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4
  * aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77
  * aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6
  * aws_iam_policy.sqs-event-consumer_lambda_execution-policy_4069CEFE
  * aws_iam_policy.sqs-event-consumer_sqs-policy_9FE8B4E1
  * aws_iam_policy.synthetics_synthetics_synthetic_check_access_policy_9A7D8849
  * aws_iam_role.application_ecs_service_ecs-iam_ecs-execution-role_FB754BAA
  * aws_iam_role.application_ecs_service_ecs-iam_ecs-task-role_A72990ED
  * aws_iam_role.application_ecs_service_ecs_codedeploy_ecs_code_deploy_role_175DB7D3
  * aws_iam_role.sqs-event-consumer_lambda-code-deploy_code-deploy-role_9A627C46
  * aws_iam_role.sqs-event-consumer_lambda_execution-role_971EF5C2
  * aws_iam_role.synthetics_synthetic_check_role_A3A5C38B
  * aws_lambda_function.sqs-event-consumer_lambda_477DAF53
  * aws_route53_zone.application_base_dns_subhosted_zone_77521D1C
  * aws_s3_bucket.sqs-event-consumer_lambda_code-bucket_DA349A4E
  * aws_s3_bucket.synthetics_synthetics_synthetic_check_artifacts_53DD59E6
  * aws_security_group.application_application_load_balancer_alb_security_group_7B45D070
  * aws_security_group.application_ecs_service_ecs_security_group_231C6B1E
  * aws_sns_topic.pagerduty_alarm-critical-topic_F1534579
  * aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3
  * aws_sqs_queue.batch-delete-consumer-queue_redrive_sqs_queue_B3F8A415
  * aws_sqs_queue.batch-delete-consumer-queue_sqs_queue_D3FD6851
  * aws_sqs_queue.sqs-event-consumer_lambda_sqs_queue_0D24AF25
  * aws_sqs_queue.sqs-event-consumer_lambda_sqs_queue_redrive_sqs_queue_CCE99119
  * aws_sqs_queue.user-events-sns-subscription_sns-topic-dql_E3EC76B2
  * aws_sqs_queue_policy.user-events-sns-subscription_sns-dlq-policy_CF731C06
  * aws_sqs_queue_policy.user-events-sns-subscription_sns-sqs-policy_C14BCCA0
  * aws_synthetics_canary.synthetics_synthetics_synthetic_check_query_0_99E4AE1B
  * aws_synthetics_canary.synthetics_synthetics_synthetic_check_uptime_0_4168D0DB



<details><summary>Change Result (Click me)</summary>

```hcl

  # data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)
      + version       = "2012-10-17"

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:DescribeLogGroups",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
              + "xray:GetSamplingRules",
              + "xray:GetSamplingStatisticSummaries",
              + "xray:GetSamplingTargets",
              + "xray:PutTelemetryRecords",
              + "xray:PutTraceSegments",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:BatchGet*",
              + "dynamodb:BatchWrite*",
              + "dynamodb:Delete*",
              + "dynamodb:DescribeTable",
              + "dynamodb:Get*",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:dynamodb:us-east-1:996905175585:table/ANNOT-Prod-highlight-notes",
              + "arn:aws:dynamodb:us-east-1:996905175585:table/ANNOT-Prod-highlight-notes/*",
            ]
        }
      + statement {
          + actions   = [
              + "sqs:DeleteMessage",
              + "sqs:ReceiveMessage",
              + "sqs:SendMessage",
              + "sqs:SendMessageBatch",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sqs:us-east-1:996905175585:AnnotationsAPI-Prod-Batch-Delete-Consumer-Queue",
            ]
        }
    }

  # data.aws_iam_policy_document.sqs-event-consumer_lambda_sqs_policy_D5A5EF19 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "sqs-event-consumer_lambda_sqs_policy_D5A5EF19" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:ChangeMessageVisibility",
              + "sqs:DeleteMessage",
              + "sqs:GetQueueAttributes",
              + "sqs:ReceiveMessage",
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sqs:us-east-1:996905175585:AnnotationsAPI-Prod-Sqs-Event-Consumer-Queue",
            ]
        }
    }

  # data.aws_iam_policy_document.synthetics_synthetics_synthetic_check_access_4C83FECF will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "synthetics_synthetics_synthetic_check_access_4C83FECF" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)
      + version       = "2012-10-17"

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::pocket-annotationsapi-prod-synthetic-checks/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::pocket-syntheticchecks-prod/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetBucketLocation",
            ]
          + resources = [
              + "arn:aws:s3:::pocket-annotationsapi-prod-synthetic-checks",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListAllMyBuckets",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "cloudwatch:PutMetricData",
            ]
          + resources = [
              + "*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "CloudWatchSynthetics",
                ]
              + variable = "cloudwatch:namespace"
            }
        }
      + statement {
          + actions   = [
              + "ec2:AttachNetworkInterface",
              + "ec2:CreateNetworkInterface",
              + "ec2:DeleteNetworkInterface",
              + "ec2:DescribeNetworkInterfaces",
            ]
          + resources = [
              + "*",
            ]
        }
    }

  # data.aws_iam_policy_document.user-events-sns-subscription_sns-dlq-policy-document_ACCD2981 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "user-events-sns-subscription_sns-dlq-policy-document_ACCD2981" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sqs:us-east-1:996905175585:AnnotationsAPI-Prod-SNS-Topic-DLQ",
            ]

          + condition {
              + test     = "ArnEquals"
              + values   = [
                  + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic",
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "sns.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # data.aws_iam_policy_document.user-events-sns-subscription_sns-sqs-policy-document_6AABE7B6 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "user-events-sns-subscription_sns-sqs-policy-document_6AABE7B6" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sqs:us-east-1:996905175585:AnnotationsAPI-Prod-Sqs-Event-Consumer-Queue",
            ]

          + condition {
              + test     = "ArnEquals"
              + values   = [
                  + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic",
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "sns.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_acm_certificate.application_alb_certificate_93966247 will be updated in-place
  ~ resource "aws_acm_certificate" "application_alb_certificate_93966247" {
        id                        = "arn:aws:acm:us-east-1:996905175585:certificate/33ef5b88-93c8-497a-b8ce-128e1ca29a8d"
      ~ tags                      = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AnnotationsAPI"
        }
      ~ tags_all                  = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_alb.application_application_load_balancer_alb_05EA9801 will be updated in-place
  ~ resource "aws_alb" "application_application_load_balancer_alb_05EA9801" {
        id                                                           = "arn:aws:elasticloadbalancing:us-east-1:996905175585:loadbalancer/app/ANNOT2022020800381408710000000d/9ca9ac81b32d5d29"
        name                                                         = "ANNOT2022020800381408710000000d"
      ~ tags                                                         = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AnnotationsAPI"
        }
      ~ tags_all                                                     = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (25 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # aws_alb_listener.application_listener_http_D74EC0ED will be updated in-place
  ~ resource "aws_alb_listener" "application_listener_http_D74EC0ED" {
        id                = "arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/ANNOT2022020800381408710000000d/9ca9ac81b32d5d29/3b7fa77651eb6896"
      ~ tags              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AnnotationsAPI"
        }
      ~ tags_all          = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_alb_listener.application_listener_https_D31CB055 will be updated in-place
  ~ resource "aws_alb_listener" "application_listener_https_D31CB055" {
        id                = "arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/ANNOT2022020800381408710000000d/9ca9ac81b32d5d29/59ca60027b6ddb92"
      ~ tags              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AnnotationsAPI"
        }
      ~ tags_all          = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_alb_listener_rule.application_ecs_service_listener_rule_903F815F will be updated in-place
  ~ resource "aws_alb_listener_rule" "application_ecs_service_listener_rule_903F815F" {
        id           = "arn:aws:elasticloadbalancing:us-east-1:996905175585:listener-rule/app/ANNOT2022020800381408710000000d/9ca9ac81b32d5d29/59ca60027b6ddb92/71608ce5f0a93a1d"
      ~ tags         = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AnnotationsAPI"
        }
      ~ tags_all     = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_alb_target_group.application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B will be updated in-place
  ~ resource "aws_alb_target_group" "application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B" {
        id                                 = "arn:aws:elasticloadbalancing:us-east-1:996905175585:targetgroup/ANNOTb20220208003811794100000002/a0f0eb4ea2a923c8"
        name                               = "ANNOTb20220208003811794100000002"
      ~ tags                               = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AnnotationsAPI"
            "type"           = "blue"
        }
      ~ tags_all                           = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
          + "env_code"       = "prod"
            # (5 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_alb_target_group.application_ecs_service_green_target_group_ecs_target_group_4E06DCA6 will be updated in-place
  ~ resource "aws_alb_target_group" "application_ecs_service_green_target_group_ecs_target_group_4E06DCA6" {
        id                                 = "arn:aws:elasticloadbalancing:us-east-1:996905175585:targetgroup/ANNOTg20220208003812626700000008/6b1dc28598a9ccb4"
        name                               = "ANNOTg20220208003812626700000008"
      ~ tags                               = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AnnotationsAPI"
            "type"           = "green"
        }
      ~ tags_all                           = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
          + "env_code"       = "prod"
            # (5 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99 will be updated in-place
  ~ resource "aws_appautoscaling_target" "application_autoscaling_autoscaling_target_42BF5C99" {
        id                 = "service/AnnotationsAPI-Prod/AnnotationsAPI-Prod"
        tags               = {}
      ~ tags_all           = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.app-log-group will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "app-log-group" {
        id                = "/Backend/AnnotationsAPI-Prod/ecs/app"
        name              = "/Backend/AnnotationsAPI-Prod/ecs/app"
      ~ tags              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AnnotationsAPI"
        }
      ~ tags_all          = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.aws-otel-collector-log-group will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "aws-otel-collector-log-group" {
        id                = "/Backend/AnnotationsAPI-Prod/ecs/aws-otel-collector"
        name              = "/Backend/AnnotationsAPI-Prod/ecs/aws-otel-collector"
      ~ tags              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AnnotationsAPI"
        }
      ~ tags_all          = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.sqs-event-consumer_lambda_log-group_A465ADCF will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "sqs-event-consumer_lambda_log-group_A465ADCF" {
        id                = "/aws/lambda/AnnotationsAPI-Prod-Sqs-Event-Consumer-Function"
        name              = "/aws/lambda/AnnotationsAPI-Prod-Sqs-Event-Consumer-Function"
      ~ tags              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AnnotationsAPI"
        }
      ~ tags_all          = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.application_alarm-httptarget5xxerrorrate_F94D87C0 will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "application_alarm-httptarget5xxerrorrate_F94D87C0" {
        id                                    = "AnnotationsAPI-Prod-Alarm-HTTPTarget5xxErrorRate"
      ~ tags                                  = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AnnotationsAPI"
        }
      ~ tags_all                              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1 will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "application_autoscaling_scale_in_alarm_850BE3A1" {
        id                                    = "AnnotationsAPI-Prod Service Low CPU"
      ~ tags                                  = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AnnotationsAPI"
        }
      ~ tags_all                              = {
          + "app_code"       = "pocket"
          + "component

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

        "service"        = "AnnotationsAPI"
        }
      ~ tags_all              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role.application_ecs_service_ecs_codedeploy_ecs_code_deploy_role_175DB7D3 will be updated in-place
  ~ resource "aws_iam_role" "application_ecs_service_ecs_codedeploy_ecs_code_deploy_role_175DB7D3" {
        id                    = "AnnotationsAPI-Prod-ECSCodeDeployRole"
        name                  = "AnnotationsAPI-Prod-ECSCodeDeployRole"
      ~ tags                  = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AnnotationsAPI"
        }
      ~ tags_all              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role.sqs-event-consumer_lambda-code-deploy_code-deploy-role_9A627C46 will be updated in-place
  ~ resource "aws_iam_role" "sqs-event-consumer_lambda-code-deploy_code-deploy-role_9A627C46" {
        id                    = "AnnotationsAPI-Prod-Sqs-Event-Consumer-CodeDeployRole"
        name                  = "AnnotationsAPI-Prod-Sqs-Event-Consumer-CodeDeployRole"
        tags                  = {}
      ~ tags_all              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role.sqs-event-consumer_lambda_execution-role_971EF5C2 will be updated in-place
  ~ resource "aws_iam_role" "sqs-event-consumer_lambda_execution-role_971EF5C2" {
        id                    = "AnnotationsAPI-Prod-Sqs-Event-Consumer-ExecutionRole"
        name                  = "AnnotationsAPI-Prod-Sqs-Event-Consumer-ExecutionRole"
      ~ tags                  = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AnnotationsAPI"
        }
      ~ tags_all              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role.synthetics_synthetic_check_role_A3A5C38B will be updated in-place
  ~ resource "aws_iam_role" "synthetics_synthetic_check_role_A3A5C38B" {
        id                    = "pocket-annotationsapi-prod-synthetic-check"
        name                  = "pocket-annotationsapi-prod-synthetic-check"
      ~ tags                  = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AnnotationsAPI"
        }
      ~ tags_all              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # aws_lambda_function.sqs-event-consumer_lambda_477DAF53 will be updated in-place
  ~ resource "aws_lambda_function" "sqs-event-consumer_lambda_477DAF53" {
        id                             = "AnnotationsAPI-Prod-Sqs-Event-Consumer-Function"
      ~ tags                           = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AnnotationsAPI"
        }
      ~ tags_all                       = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (27 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_route53_zone.application_base_dns_subhosted_zone_77521D1C will be updated in-place
  ~ resource "aws_route53_zone" "application_base_dns_subhosted_zone_77521D1C" {
        id                  = "Z04486481VH68XXRQZ04W"
        name                = "annotations-api.readitlater.com"
      ~ tags                = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AnnotationsAPI"
        }
      ~ tags_all            = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # aws_s3_bucket.sqs-event-consumer_lambda_code-bucket_DA349A4E will be updated in-place
  ~ resource "aws_s3_bucket" "sqs-event-consumer_lambda_code-bucket_DA349A4E" {
        id                          = "pocket-annotationsapi-prod-sqs-event-consumer"
      ~ tags                        = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AnnotationsAPI"
        }
      ~ tags_all                    = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket.synthetics_synthetics_synthetic_check_artifacts_53DD59E6 will be updated in-place
  ~ resource "aws_s3_bucket" "synthetics_synthetics_synthetic_check_artifacts_53DD59E6" {
        id                          = "pocket-annotationsapi-prod-synthetic-checks"
        tags                        = {}
      ~ tags_all                    = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_security_group.application_application_load_balancer_alb_security_group_7B45D070 will be updated in-place
  ~ resource "aws_security_group" "application_application_load_balancer_alb_security_group_7B45D070" {
        id                     = "sg-0c29baaa84d59b6f8"
        name                   = "AnnotationsAPI-Prod-HTTP/S Security Group20220208003811808100000003"
      ~ tags                   = {
            "Name"           = "AnnotationsAPI-Prod-HTTP/S Security Group"
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AnnotationsAPI"
        }
      ~ tags_all               = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
          + "env_code"       = "prod"
            # (5 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # aws_security_group.application_ecs_service_ecs_security_group_231C6B1E will be updated in-place
  ~ resource "aws_security_group" "application_ecs_service_ecs_security_group_231C6B1E" {
        id                     = "sg-043047953d5242bbf"
        name                   = "AnnotationsAPI-Prod-ECSSecurityGroup2022020800381409070000000e"
      ~ tags                   = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AnnotationsAPI"
        }
      ~ tags_all               = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # aws_sns_topic.pagerduty_alarm-critical-topic_F1534579 will be updated in-place
  ~ resource "aws_sns_topic" "pagerduty_alarm-critical-topic_F1534579" {
        id                                       = "arn:aws:sns:us-east-1:996905175585:AnnotationsAPI-Prod-Infrastructure-Alarm-Critical"
        name                                     = "AnnotationsAPI-Prod-Infrastructure-Alarm-Critical"
        tags                                     = {}
      ~ tags_all                                 = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (28 unchanged attributes hidden)
    }

  # aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3 will be updated in-place
  ~ resource "aws_sns_topic" "pagerduty_alarm-non-critical-topic_53C1A3B3" {
        id                                       = "arn:aws:sns:us-east-1:996905175585:AnnotationsAPI-Prod-Infrastructure-Alarm-Non-Critical"
        name                                     = "AnnotationsAPI-Prod-Infrastructure-Alarm-Non-Critical"
        tags                                     = {}
      ~ tags_all                                 = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (28 unchanged attributes hidden)
    }

  # aws_sqs_queue.batch-delete-consumer-queue_redrive_sqs_queue_B3F8A415 will be updated in-place
  ~ resource "aws_sqs_queue" "batch-delete-consumer-queue_redrive_sqs_queue_B3F8A415" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/AnnotationsAPI-Prod-Batch-Delete-Consumer-Queue-Deadletter"
        name                              = "AnnotationsAPI-Prod-Batch-Delete-Consumer-Queue-Deadletter"
      ~ tags                              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AnnotationsAPI"
        }
      ~ tags_all                          = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)
    }

  # aws_sqs_queue.batch-delete-consumer-queue_sqs_queue_D3FD6851 will be updated in-place
  ~ resource "aws_sqs_queue" "batch-delete-consumer-queue_sqs_queue_D3FD6851" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/AnnotationsAPI-Prod-Batch-Delete-Consumer-Queue"
        name                              = "AnnotationsAPI-Prod-Batch-Delete-Consumer-Queue"
      ~ tags                              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AnnotationsAPI"
        }
      ~ tags_all                          = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)
    }

  # aws_sqs_queue.sqs-event-consumer_lambda_sqs_queue_0D24AF25 will be updated in-place
  ~ resource "aws_sqs_queue" "sqs-event-consumer_lambda_sqs_queue_0D24AF25" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/AnnotationsAPI-Prod-Sqs-Event-Consumer-Queue"
        name                              = "AnnotationsAPI-Prod-Sqs-Event-Consumer-Queue"
      ~ tags                              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AnnotationsAPI"
        }
      ~ tags_all                          = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)
    }

  # aws_sqs_queue.sqs-event-consumer_lambda_sqs_queue_redrive_sqs_queue_CCE99119 will be updated in-place
  ~ resource "aws_sqs_queue" "sqs-event-consumer_lambda_sqs_queue_redrive_sqs_queue_CCE99119" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/AnnotationsAPI-Prod-Sqs-Event-Consumer-Queue-Deadletter"
        name                              = "AnnotationsAPI-Prod-Sqs-Event-Consumer-Queue-Deadletter"
      ~ tags                              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AnnotationsAPI"
        }
      ~ tags_all                          = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)
    }

  # aws_sqs_queue.user-events-sns-subscription_sns-topic-dql_E3EC76B2 will be updated in-place
  ~ resource "aws_sqs_queue" "user-events-sns-subscription_sns-topic-dql_E3EC76B2" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/AnnotationsAPI-Prod-SNS-Topic-DLQ"
        name                              = "AnnotationsAPI-Prod-SNS-Topic-DLQ"
      ~ tags                              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AnnotationsAPI"
        }
      ~ tags_all                          = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)
    }

  # aws_sqs_queue_policy.user-events-sns-subscription_sns-dlq-policy_CF731C06 will be updated in-place
  ~ resource "aws_sqs_queue_policy" "user-events-sns-subscription_sns-dlq-policy_CF731C06" {
        id        = "https://sqs.us-east-1.amazonaws.com/996905175585/AnnotationsAPI-Prod-SNS-Topic-DLQ"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sqs:SendMessage"
                      - Condition = {
                          - ArnEquals = {
                              - "aws:SourceArn" = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "sns.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sqs:us-east-1:996905175585:AnnotationsAPI-Prod-SNS-Topic-DLQ"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_sqs_queue_policy.user-events-sns-subscription_sns-sqs-policy_C14BCCA0 will be updated in-place
  ~ resource "aws_sqs_queue_policy" "user-events-sns-subscription_sns-sqs-policy_C14BCCA0" {
        id        = "https://sqs.us-east-1.amazonaws.com/996905175585/AnnotationsAPI-Prod-Sqs-Event-Consumer-Queue"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sqs:SendMessage"
                      - Condition = {
                          - ArnEquals = {
                              - "aws:SourceArn" = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "sns.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sqs:us-east-1:996905175585:AnnotationsAPI-Prod-Sqs-Event-Consumer-Queue"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_synthetics_canary.synthetics_synthetics_synthetic_check_query_0_99E4AE1B will be updated in-place
  ~ resource "aws_synthetics_canary" "synthetics_synthetics_synthetic_check_query_0_99E4AE1B" {
        id                       = "annot-prod-query-0"
        name                     = "annot-prod-query-0"
        tags                     = {}
      ~ tags_all                 = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_synthetics_canary.synthetics_synthetics_synthetic_check_uptime_0_4168D0DB will be updated in-place
  ~ resource "aws_synthetics_canary" "synthetics_synthetics_synthetic_check_uptime_0_4168D0DB" {
        id                       = "annot-prod-uptime-0"
        name                     = "annot-prod-uptime-0"
        tags                     = {}
      ~ tags_all                 = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-annotationsapi"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 54 to change, 0 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobID":"cc226498-e7b9-431f-8751-ad80ad4f2dbc","JobName":"annotations-api_infrastructure_plan_prod","PRNumber":572,"Program":"tfcmt","SHA1":"8cce0ef636735b4f73d5efb2fde7796641120371","Target":"annotations-api-cdk","Vars":{}} -->